app/views/comments/_form.html.erb

    <%= f.label :proyect_id %>
    <%= f.select :proyect_id, Proyect.all.collect { |p| [ p.name, p.id ] }, { include_blank: true }, { required: true } %>
---
SELECT "proyects".* FROM "proyects"