app/views/proyects/_form.html.erb

SELECT "categories".* FROM "categories"
---
    <%= f.label :category_id %>
    <%= f.select :category_id, Category.all.collect { |c| [ c.name, c.id ] }, { include_blank: true }, { required: true } %>