app/views/proyects/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."proyect_id" = 31
---
  <div class="comments-stream">
    <% if @proyect.comments && @proyect.comments.count != 0%>