app/controllers/categories_controller.rb

  def destroy
    @category.destroy
---
DELETE FROM "categories" WHERE "categories"."id" = $1  [["id", 4]]

    def set_category
      @category = Category.find(params[:id])
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]