app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments"
---
  def index
    @comments = @proyect.comments.all

INSERT INTO "comments" ("comment_text", "comment_date", "created_at", "updated_at", "user_id", "proyect_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["comment_text", "Valar Morgulis"], ["comment_date", 2017-05-11 00:00:00 UTC], ["created_at", 2017-05-12 00:34:11 UTC], ["updated_at", 2017-05-12 00:34:11 UTC], ["user_id", 6], ["proyect_id", 8]]
---
  def create
    @comment = @proyect.comments.new(comment_params)
    @comment.comment_date = Date.today
    @comment.user_id = current_user.id

    respond_to do |format|
      if @comment.save

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 51], ["LIMIT", 1]]
---
  def set_comment
    load_project
    @comment = @proyect.comments.find(params[:id])

SELECT  "proyects".* FROM "proyects" WHERE "proyects"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
  def load_project
    @proyect = Proyect.find(params[:proyect_id])