app/controllers/proyects_controller.rb

  def show
    @comments = Comment.includes(:user).submitted_to(@proyect)
---
SELECT "comments".* FROM "comments" WHERE "comments"."proyect_id" = 26
SELECT "users".* FROM "users" WHERE "users"."id" IN (3, 6, 5)