app/controllers/proyects_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "proyects".* FROM "proyects"
SELECT "users".id FROM "users" INNER JOIN "proyects_users" ON "users"."id" = "proyects_users"."user_id" WHERE "proyects_users"."proyect_id" = $1  [["proyect_id", 1]]
---
  def index
    if params[:user_id]
      user = User.find(params[:user_id])
      @proyects = Proyect.where(founder: user.username)
    else
      @proyects = Proyect.all

INSERT INTO "proyects" ("name", "description", "initial_date", "due_date", "actual_money", "goal_money", "score", "created_at", "updated_at", "category_id", "founder") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
  def create
    @proyect = Proyect.new(proyect_params)
    @proyect.score = 0
    @proyect.actual_money = 0
    @proyect.initial_date = Date.today
    @proyect.founder = current_user.username

    respond_to do |format|
      if @proyect.save

DELETE FROM "proyects" WHERE "proyects"."id" = $1  [["id", 31]]
---
  def destroy
    @proyect.destroy

SELECT  "proyects".* FROM "proyects" WHERE "proyects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_proyect
    @proyect = Proyect.find(params[:id])